## Pandas

In [1]:
import numpy as np
import pandas as pd

### Pandas Series

In [2]:
x = ['a','b','c','d','e']

In [3]:
y = [1,2,3,4,5]

In [4]:
z = {1: 'a', 2:'b', 3:'c', 4: 'd', 5:'e'}

In [5]:
pd.Series(data= x)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [6]:
pd.Series(data = x, index = y)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [7]:
pd.Series(data = y, index = x)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
a = pd.Series(data = x, index = y)
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [9]:
b = pd.Series(data = x, index = y)
b

1    a
2    b
3    c
4    d
5    e
dtype: object

In [10]:
a+b

1    aa
2    bb
3    cc
4    dd
5    ee
dtype: object

In [11]:
a = pd.Series(data = y, index = x)
b = pd.Series(data = y, index = x)
a+b

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [12]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9, 0, 1, 2]
D = [3,4,5,6]
E = [7,8,9,0]

In [13]:
df = pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z']) # first list -> Data, second list - Row indexes
# third list ->Column names.

In [14]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

### Adding a new column

In [17]:
df['p'] = df['y'] + df['z']

In [18]:
df

   w  x  y  z   P   p
a  1  2  3  4   7   7
b  5  6  7  8  15  15
c  9  0  1  2   3   3
d  3  4  5  6  11  11
e  7  8  9  0   9   9

In [23]:
df.drop('P', axis=1, inplace=True)

In [24]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [25]:
df.drop('e')

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [26]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [35]:
df.drop('e', inplace=True) # removing row.

## Accesing elements in a Dataframe

In [38]:
# Accessing a single Column.
print(df)
df['y']

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

a    3
b    7
c    1
d    5
Name: y, dtype: int64

In [39]:
# to access a single row
df.loc['a']

w    1
x    2
y    3
z    4
p    7
Name: a, dtype: int64

In [41]:
# if you want to access rows using numeric indexes.
print(df.iloc[1])
print(df.iloc[2])

w     5
x     6
y     7
z     8
p    15
Name: b, dtype: int64
w    9
x    0
y    1
z    2
p    3
Name: c, dtype: int64

In [46]:
# to access a particular element.
print(df)
# access 5 - we need row index and column name => df.loc['index', 'column name']
print(f"\n Element found {df.loc['d','y']}")

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

 Element found 5

### Conditional accessing

In [49]:
# to use condition on the data frame
print(df > 3)
# the above statement will return a true, false table were all the elements greater than 3 will be true and all the elements
# that are less than 3 will be displayed as false
df == 3 # only 3 is true.

       w      x      y      z      p
a  False  False  False   True   True
b   True   True   True   True   True
c   True  False  False  False  False
d  False   True   True   True   True

       w      x      y      z      p
a  False  False   True  False  False
b  False  False  False  False  False
c  False  False  False  False   True
d   True  False  False  False  False

In [50]:
# to get values instead of true, false value 
df[df > 3]
# will return all the element's values that are greater than 3 as floats. and all values that are less 
# than 3 will be returned as 'NaN'

     w    x    y    z     p
a  NaN  NaN  NaN  4.0   7.0
b  5.0  6.0  7.0  8.0  15.0
c  9.0  NaN  NaN  NaN   NaN
d  NaN  4.0  5.0  6.0  11.0

In [52]:
# To access column that have satified the condition.
df[df['w'] > 3]

# will return the rows for which the column w have value greater than 3

   w  x  y  z   p
b  5  6  7  8  15
c  9  0  1  2   3

In [55]:
# to access only particular column data.
print(df[df['w'] > 3][['w','x']]) # w, x are column names.
print()
print(df[df['w'] > 3][['w']])

   w  x
b  5  6
c  9  0

   w
b  5
c  9

### usage of &, |

In [60]:
print(df)
df[(df['w']>3) & (df['z'] > 2)]

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

   w  x  y  z   p
b  5  6  7  8  15

In [63]:
print(df)
df[(df['w']>3) | (df['z'] > 4)]

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

   w  x  y  z   p
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

## Handling Missing data

In [65]:
import numpy as np

In [67]:
d = {'a':[1,2,3,4,5], 'b':[6,7,8,9,np.nan], 'c':[0,1,2,np.nan, np.nan], 'd':[3,4,np.nan, np.nan, np.nan], 'e':[5, np.nan, np.nan, np.nan, np.nan]}

In [81]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [82]:
df = pd.DataFrame(d)

In [83]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [84]:
# to drop alldata that are null.
df.dropna() # to remove entirely from a dataframe use inplace = true.

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [85]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [86]:
# Using threh hold to select data.
# ie- we can set how much data we need in a data frame as a not null value and those rows which satisfies this condition will be selected.
df.dropna(thresh=3) # selects row that have atleast 3 not null values.

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN

In [87]:
# Using threh hold to select data.
# ie- we can set how much data we need in a data frame as a not null value and those rows which satisfies this condition will be selected.
df.dropna(thresh=5) # selects row that have atleast 5 not null values.

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

### To fill a missing value

In [89]:
df.fillna(1) # fills all the missing values with 1

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [95]:
# To fill using average(mean) values. in Co;umns.
print(df)
print()
df['b'].fillna(value= df['b'].mean(), inplace=True) # here the last missing valkue in b column will be changed to the mean value
# of the b column . which here is 7.5

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  7.5  NaN  NaN  NaN

## Analysing data using GroupBy

In [96]:
p = {'item':['apple', 'apple', 'orange', 'orange', 'guns', 'guns'], 'days':['mon', 'tue', 'we', 'thu', 'fri', 'sat'], 'sales': [100, 80, 200, 100, 5, 10]}

In [97]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tue', 'we', 'thu', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [98]:
df = pd.DataFrame(p)

In [99]:
df

     item days  sales
0   apple  mon    100
1   apple  tue     80
2  orange   we    200
3  orange  thu    100
4    guns  fri      5
5    guns  sat     10

In [101]:
x = df.groupby('item')

In [102]:
x

In [104]:
x.mean() # will return mean value based on the items.

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [105]:
y = df.groupby('days')

In [106]:
y.mean()

      sales
days
fri     5.0
mon   100.0
sat    10.0
thu   100.0
tue    80.0
we    200.0

In [107]:
x.sum() # returns sum of sales

        sales
item
apple     180
guns       15
orange    300

In [109]:
x.std() # returns std deviation|

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [110]:
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [111]:
x.max()

       days  sales
item
apple   tue    100
guns    sat     10
orange   we    200

In [114]:
x.min()

       days  sales
item
apple   mon     80
guns    fri      5
orange  thu    100

In [115]:
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [116]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000

## Joining

In [117]:
x1 = {'a':[1,2,3], 'b':[5, 6,7]}
y1 = {'c':[3,4,5], 'd':[2,3,6]}

In [118]:
x = pd.DataFrame(x1, index = ['p1', 'p2', 'p3'])
y = pd.DataFrame(y1, index = ['p1', 'p2', 'p3'])

In [119]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [120]:
y

    c  d
p1  3  2
p2  4  3
p3  5  6

In [121]:
# to join these two dfs
x.join(y)

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

In [125]:
x.join(y, how="right")

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

In [126]:
x.join(y, how="left")

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

In [127]:
x.join(y, how="outer")

    a  b  c  d
p1  1  5  3  2
p2  2  6  4  3
p3  3  7  5  6

### Concatenation

In [136]:
x1 = {'a':[1,1,1,1,1], 'b':[1,1,1,1,1], 'c':[1,1,1,1,1], 'd':[1,1,1,1,1], 'e':[1,1,1,1,1]}
x2 = {'e':[2,2,2,2,2], 'f':[2,2,2,2,2],  'g':[2,2,2,2,2], 'h':[2,2,2,2,2], 'i':[2,2,2,2,2]}
x3 = {'a':[3,3,3,3,3], 'b':[3,3,3,3,3], 'c':[3,3,3,3,3], 'd':[3,3,3,3,3], 'e':[3,3,3,3,3]}

In [137]:
df1 = pd.DataFrame(x1, index = [1,2,3,4,5])
df2 = pd.DataFrame(x2, index = [1,2,3,4,5])
df3 = pd.DataFrame(x3, index = [5,6,7,8,9])

In [138]:
df1

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1

In [139]:
df2

   e  f  g  h  i
1  2  2  2  2  2
2  2  2  2  2  2
3  2  2  2  2  2
4  2  2  2  2  2
5  2  2  2  2  2

In [140]:
df3

   a  b  c  d  e
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [141]:
# Concatenation
pd.concat([df1, df2])

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0

In [142]:
# Concatenation
pd.concat([df1, df2], axis=1)

   a  b  c  d  e  e  f  g  h  i
1  1  1  1  1  1  2  2  2  2  2
2  1  1  1  1  1  2  2  2  2  2
3  1  1  1  1  1  2  2  2  2  2
4  1  1  1  1  1  2  2  2  2  2
5  1  1  1  1  1  2  2  2  2  2

In [143]:
pd.concat([df1, df3], axis=1)

     a    b    c    d    e    a    b    c    d    e
1  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  3.0  3.0  3.0  3.0  3.0
6  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
7  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
8  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
9  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0

In [145]:
pd.concat([df1, df3], axis=0)

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3